[
  "عن أبي هريرة أن رسول الله ﷺ قال: مَن صام رمضان إيمانًا واحتسابًا غُفر له ما تقدَّم من ذنبه",
  "اللهم سلمني إلى رمضان وسلم لي رمضان وتسلمه مني متقبلاً",
  "إن صمت فليصم سمعك وبصرك ولسانك",
  "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: «إذا جاء رمضان فتحت أبواب الجنة وغلقت أبواب النار وصفدت الشياطين»",
  "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم كان يقول: «الصلوات الخمس والجمعة إلى الجمعة ورمضان إلى رمضان مكفرات ما بينهن إذا اجتنب الكبائر»",
  "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: «من قام رمضان إيمانًا واحتسابًا غفر له ما تقدم من ذنبه»"
]
